# GetAll Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryGraphicsManager..::..GetAll Method
TemporaryGraphicsManager Class See Also
---
Returns all temporary graphics object indexes managed by this manager.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ICollection<int> GetAll()
```

Visual Basic
---
```text
Public Function GetAll As ICollection(Of Integer)
```

Visual C++
---
```text
public:
ICollection<int>^ GetAll()
```

# ### Return Value
Collection of temporary graphics object indexes managed by this manager.
# See Also
TemporaryGraphicsManager Class
Autodesk.Revit.DB Namespace